{"genre":{"0":"business","1":"business","2":"business","3":"business","4":"business","5":"business","6":"business","7":"business","8":"business","9":"business","10":"business","11":"business","12":"business","13":"business","14":"business","15":"business","16":"business","17":"business","18":"business","19":"business","20":"business","21":"business","22":"business","23":"technology","24":"technology","25":"technology","26":"technology","27":"technology","28":"technology","29":"technology","30":"technology","31":"technology","32":"technology","33":"technology","34":"technology","35":"technology","36":"technology","37":"technology","38":"technology","39":"technology","40":"technology","41":"technology","42":"technology","43":"technology","44":"technology","45":"technology","46":"technology","47":"entertainment","48":"entertainment","49":"entertainment","50":"entertainment","51":"entertainment","52":"entertainment","53":"entertainment","54":"entertainment","55":"entertainment","56":"entertainment","57":"entertainment","58":"entertainment","59":"entertainment","60":"entertainment","61":"entertainment","62":"entertainment","63":"entertainment","64":"entertainment","65":"entertainment","66":"entertainment","67":"entertainment","68":"entertainment","69":"entertainment","70":"entertainment","71":"entertainment","72":"sports","73":"sports","74":"sports","75":"sports","76":"sports","77":"sports","78":"sports","79":"sports","80":"sports","81":"sports","82":"sports","83":"sports","84":"sports","85":"sports","86":"sports","87":"sports","88":"sports","89":"sports","90":"sports","91":"sports","92":"sports","93":"sports","94":"sports","95":"sports","96":"sports"},"publish_date":{"0":"01 Sep","1":"01 Sep","2":"01 Sep","3":"01 Sep","4":"01 Sep","5":"01 Sep","6":"01 Sep","7":"01 Sep","8":"01 Sep","9":"31 Aug","10":"01 Sep","11":"01 Sep","12":"01 Sep","13":"01 Sep","14":"01 Sep","15":"31 Aug","16":"01 Sep","17":"01 Sep","18":"01 Sep","19":"01 Sep","20":"01 Sep","21":"01 Sep","22":"01 Sep","23":"31 Aug","24":"01 Sep","25":"01 Sep","26":"31 Aug","27":"31 Aug","28":"31 Aug","29":"01 Sep","30":"31 Aug","31":"01 Sep","32":"31 Aug","33":"01 Sep","34":"31 Aug","35":"01 Sep","36":"01 Sep","37":"31 Aug","38":"31 Aug","39":"31 Aug","40":"31 Aug","41":"31 Aug","42":"31 Aug","43":"01 Sep","44":"01 Sep","45":"01 Sep","46":"01 Sep","47":"01 Sep","48":"01 Sep","49":"01 Sep","50":"01 Sep","51":"01 Sep","52":"01 Sep","53":"01 Sep","54":"01 Sep","55":"01 Sep","56":"31 Aug","57":"01 Sep","58":"01 Sep","59":"01 Sep","60":"31 Aug","61":"31 Aug","62":"01 Sep","63":"01 Sep","64":"01 Sep","65":"01 Sep","66":"01 Sep","67":"01 Sep","68":"01 Sep","69":"01 Sep","70":"01 Sep","71":"01 Sep","72":"31 Aug","73":"31 Aug","74":"01 Sep","75":"01 Sep","76":"01 Sep","77":"01 Sep","78":"01 Sep","79":"01 Sep","80":"01 Sep","81":"31 Aug","82":"01 Sep","83":"01 Sep","84":"01 Sep","85":"01 Sep","86":"01 Sep","87":"01 Sep","88":"01 Sep","89":"01 Sep","90":"01 Sep","91":"01 Sep","92":"01 Sep","93":"01 Sep","94":"01 Sep","95":"01 Sep","96":"01 Sep"},"source":{"0":"Moneycontrol","1":"The Associated Press","2":"Times Now","3":"Reuters","4":"Reuters","5":"Hindustan Times","6":"Free Press Journal","7":"Outlook","8":"Reuters","9":"YourStory","10":"Reuters","11":"Hindustan Times","12":"Moneycontrol","13":"Indian Express","14":"Moneycontrol","15":"CNBCTV18","16":"Financial Express","17":"Moneycontrol","18":"Moneycontrol","19":"News18","20":"Moneycontrol","21":"CNBC-TV18","22":"CNBC-TV18","23":"Reuters","24":"Twitter","25":"The Associated Press","26":"Reuters","27":"Financial Express","28":"Moneycontrol","29":"Moneycontrol","30":"Digit","31":"Reuters","32":"Apple","33":"News18","34":"Reuters","35":"Reuters","36":"Google","37":"CNBC-TV18","38":"Reuters","39":"Reuters","40":"Digit","41":"Digit","42":"Twitter","43":"Reuters","44":"Outlook","45":"Instagram","46":null,"47":"News18","48":"LatestLY","49":"Twitter","50":"Moneycontrol","51":"Bollywood Hungama","52":"News18","53":"News18","54":"Outlook India","55":"PINKVILLA","56":"Bollywood Hungama","57":"PINKVILLA","58":"The Associated Press","59":"Outlook India","60":"Bollywood Hungama","61":"Bollywood Hungama","62":"Bollywood Hungama","63":"Hindustan Times","64":"Hindustan Times","65":"Hindustan Times","66":null,"67":null,"68":null,"69":null,"70":null,"71":null,"72":"BCCI","73":"ICC","74":"News18","75":"ACC","76":"ANI","77":"Instagram","78":"ICC","79":"Twitter","80":"Sportskeeda","81":"BCCI","82":"Hindustan Times","83":"Hindustan Times","84":"Sportskeeda","85":"Twitter","86":"Hindustan Times","87":"Times Now","88":"Twitter","89":"Hindustan Times","90":"Sportskeeda","91":"Sportskeeda","92":"Sportskeeda","93":"Hindustan Times","94":"Sportskeeda","95":"Sportskeeda","96":null},"title":{"0":"Don't eff this up: Bezos recalls warning from son for Lord of Rings' prequel","1":"Snap CEO confirms 20% job cuts, says 'We must reduce cost to avoid ongoing losses'","2":"Price of commercial LPG cylinders cut by up to ₹100; list of rates in cities released","3":"Chairman of Russia's 2nd largest oil firm dies after fall from hospital window: Reports","4":"SpiceJet shares fall nearly 15% after CFO resigns amid widening losses","5":"August GST revenue collection jumps 28% YoY at ₹1.44 lakh crore","6":"SpiceJet makes payments in 'graded format', delays salaries for 2nd straight month","7":"Value of UPI transactions touches all-time high of ₹10.73 lakh cr in Aug","8":"Taiwan looks forward to producing 'democracy chips' with US: Prez","9":"Dennis Woodside appointed as President of Freshworks","10":"EU mulls over capping energy prices, cutting electricity demand","11":"IMF provisionally agrees to give crisis-hit Sri Lanka $2.9-bn loan","12":"Yen drops to 24-year low to 139.59\/dollar as Treasury yields rise","13":"Lufthansa to cancel almost all flights on Friday from 2 German cities amid strike","14":"Unemployment rate fell to 7.6% during Apr-June in urban areas: NSO","15":"NPCI in talks to acquire 10% stake in ONDC: Reports","16":"SpiceJet CFO resigns after airline's Q1 net loss widens to ₹789 cr","17":"Share prices of fuel exporters fall after windfall profit tax hike","18":"Markets end in red with Sensex falling 770 points, Nifty at 17,542","19":"Centre hikes windfall profit tax on export of diesel, ATF","20":"Sensex falls 700 points, Nifty at 17,558 in opening trade","21":"April-July fiscal deficit at ₹3.40 lakh crore, 20.5% of FY23 target","22":"Moody's cuts India's growth forecast to 7.7% from 8.8% for 2022","23":"2 top executives at Snap quit hours after report about 20% layoffs emerges","24":"Google workers protest outside US offices against $1.2 bn Israeli deal","25":"Snap CEO confirms 20% job cuts, says 'We must reduce cost to avoid ongoing losses'","26":"Musk seeks to delay Twitter trial to Nov amid whistleblower's claims","27":"Facebook's Gaming app to be shut down in October this year","28":"45-50 million EVs to be on Indian roads by 2030: KPMG","29":"Meta takes action against 2.7 cr Facebook, Instagram posts in India","30":"SoftBank Corporate Officer Rajeev Misra steps down amid record loss","31":"Tech can help solve some of India's biggest challenges: Microsoft Prez","32":"Japan calls for $24 bn investment to boost battery competitiveness","33":"Apple releases iOS 12.5.6 update for older iPhones with security fixes","34":"Cybercrime cases in 2021 rose by 5%, fraud most common motive: NCRB","35":"Taiwan looks forward to producing 'democracy chips' with US: Prez","36":"Meta plans to create more paid features for Instagram, Facebook","37":"Google to award up to $31,337 in new open source bug bounty program","38":"Infosys divests entire stake in US-based Trifacta for $12 million","39":"Netflix hires 2 top advertising executives from Snapchat-parent Snap Inc","40":"Microsoft's cloud computing changes criticised by Amazon, Google","41":"Update Mozilla Firefox browser to avoid various vulnerabilities: CERT-In to users","42":"Google to give ₹25 lakh reward for spotting bugs under new programme","43":"Apple CEO Tim Cook pledges support to Pak amid floods; Malala thanks him","44":"US orders Nvidia, AMD to halt sales of top AI chips to China","45":"Malware uses fake Google Translate app to mine crypto on 1.12 lakh PCs: Report","46":"Tesla tests SUVs under 50°C temperature in Dubai, shares pics","47":"Jacqueline deleted data on Sukesh from her phones to hamper investigation: ED","48":"Rajeev Sen, Charu Asopa call off their divorce; say 'We've decided to keep our marriage'","49":"Punjabi singer Nirvair Singh dies in road accident in Australia","50":"Aamir Khan Productions shares & then deletes apology video on occasion of Jain festival","51":"Don't eff this up: Bezos recalls warning from son for Lord of Rings' prequel","52":"At this stage of my life, I don't have to work for stardom or money: Nagarjuna","53":"I wouldn't date Kartik Aaryan as I know him 'too well': Kriti Sanon","54":"Alia Bhatt's work drives me, inspires me to do better: Kriti Sanon","55":"Salman Khan's 'Bigg Boss 16' to premiere in October: Reports","56":"Would like to work with Vijay in Ajay Gnanamuthu directorial: Vikram","57":"I dream of buying a private jet, don't have to prove I'm relatable: Kartik","58":"1st feedback of Dil Se was bad, exhibitors felt killing SRK was mistake: RGV","59":"Working with Ranbir, Big B in 'Brahmastra' was dream come true: Soni","60":"S Korea may hold survey on BTS members' mandatory military service","61":"Learned how to face camera from Kareena: Kiara","62":"Wanted my debut to be role which makes difference: Sargun on 'Cuttputlli'","63":"Amitabh Bachchan tests negative for COVID-19, resumes 'KBC 14' shoot","64":"PM Modi is strong personality yet sensitive at heart: Film producer Jain","65":"Tried to do matchmaking at party, asked Shanaya to speak to Tiger: Johar","66":"Films with bad scripts get rejected, I'm one of the victims: Chiranjeevi","67":"Tiger says Rekha played Big B's mother & love interest in films, Karan reacts","68":"Riteish, Genelia buy BMW iX electric car worth around ₹1.43 crore","69":"'The Kapil...' is my show as well, I'll be back again: Krushna Abhishek","70":"I was depressed & heartbroken: Tiger Shroff on recent 'setback' in films","71":"Been single for 1.25 yrs: Kartik on if he lied about his relationship with Sara","72":"India beat Hong Kong to reach Asia Cup Super 4 as Suryakumar breaks multiple records","73":"Suryakumar Yadav smashes most sixes ever by an Indian in a T20 Asia Cup match","74":"Hong Kong cricketer Kinchit proposes to his girlfriend in stadium after India match","75":"How do the Asia Cup 2022 points tables read after India's victory against Hong Kong?","76":"I was wondering why he wasn't leaving the field: Suryakumar on Virat Kohli's gesture","77":"Hong Kong gift jersey with handwritten message to Virat Kohli, he shares pic","78":"Australia announce their squad for T20 World Cup 2022","79":"Simply can't fathom this approach: Venkatesh Prasad on KL Rahul's 36(39) vs Hong Kong","80":"Are you saying Rahul should be dropped: Suryakumar to journalist asking if he'd open","81":"Virat Kohli bowls in T20I cricket after 6 years, concedes 6 runs in an over","82":"I wouldn't have agreed to have Pant instead of Hardik in the XI: Gambhir","83":"Before going to bat, I told Rohit that I'd try to take the tempo up: Suryakumar","84":"If you get hit by HK, it won't let you sleep: Reetinder on Avesh, Arshdeep","85":"World no. 1 Medvedev moves into US Open 3rd round with straight-sets win","86":"Dasun said we have 2 world-class bowlers, I don't see any in SL: B'desh Team Director","87":"HS Prannoy defeats ex-world champion to enter Japan Open quarterfinals","88":"I was hanging by a thread: Kyrgios on his 2nd round win vs Bonzi in US Open ","89":"This is what I do best: Serena Williams after defeating world no. 2 in US Open ","90":"Expecting too much too soon will create problems: Karim on Rahul, Virat's batting","91":"Rahul's 36, Kohli's fifty, Jadeja's bowling, all positives from India vs HK: Irfan","92":"KL Rahul probably has 'more ability' than Rohit Sharma: Gautam Gambhir","93":"I want Kohli at his best, but just make sure he doesn't score vs Aus: Ponting ","94":"Short of words to describe Suryakumar Yadav's innings: Rohit Sharma","95":"Hong Kong not the right opposition to judge Virat Kohli: Gambhir","96":"Serena beats world no.2 Anett Kontaveit, enters 3rd round of US Open"},"authors":{"0":"Ridham Gambhir","1":"Ridham Gambhir","2":"Ridham Gambhir","3":"Ridham Gambhir","4":"Ridham Gambhir","5":"Ridham Gambhir","6":"Ridham Gambhir","7":"Ridham Gambhir","8":"Ridham Gambhir","9":"Ridham Gambhir","10":"Srishty Choudhury","11":"Srishty Choudhury","12":"Ridham Gambhir","13":"Ridham Gambhir","14":"Ashley Paul","15":"Ashley Paul","16":"Purnima Rajput","17":"Purnima Rajput","18":"Anisha Joneja","19":"Anisha Joneja","20":"Purnima Rajput","21":"Purnima Rajput","22":"Srishty Choudhury","23":"Ridham Gambhir","24":"Ridham Gambhir","25":"Aishwarya Awasthi","26":"Aishwarya Awasthi","27":"Ridham Gambhir","28":"Ridham Gambhir","29":"Ridham Gambhir","30":"Ridham Gambhir","31":"Ridham Gambhir","32":"Ridham Gambhir","33":"Purnima Rajput","34":"Purnima Rajput","35":"Srishty Choudhury","36":"Srishty Choudhury","37":"Srishty Choudhury","38":"Srishty Choudhury","39":"Ashley Paul","40":"Ashley Paul","41":"Purnima Rajput","42":"Purnima Rajput","43":"Aishwarya Awasthi","44":"Aishwarya Awasthi","45":"Ashley Paul","46":"Ashley Paul","47":"Ridham Gambhir","48":"Ridham Gambhir","49":"Daisy Mowke","50":"Daisy Mowke","51":"Daisy Mowke","52":"Daisy Mowke","53":"Ridham Gambhir","54":"Ridham Gambhir","55":"Ridham Gambhir","56":"Ridham Gambhir","57":"Amartya Sharma","58":"Amartya Sharma","59":"Arnab Mukherji ","60":"Arnab Mukherji ","61":"Amartya Sharma","62":"Amartya Sharma","63":"Kameshwari","64":"Kameshwari","65":"Kameshwari","66":"Kameshwari","67":"Amartya Sharma","68":"Amartya Sharma","69":"Amartya Sharma","70":"Amartya Sharma","71":"Amartya Sharma","72":"Anmol Sharma","73":"Anmol Sharma","74":"Anmol Sharma","75":"Anmol Sharma","76":"Anmol Sharma","77":"Anmol Sharma","78":"Anmol Sharma","79":"Anmol Sharma","80":"Anmol Sharma","81":"Anmol Sharma","82":"Anmol Sharma","83":"Anmol Sharma","84":"Anmol Sharma","85":"Anmol Sharma","86":"Anmol Sharma","87":"Anmol Sharma","88":"Anmol Sharma","89":"Anmol Sharma","90":"Anmol Sharma","91":"Anmol Sharma","92":"Ankur Taliyan","93":"Ankur Taliyan","94":"Ankur Taliyan","95":"Ankur Taliyan","96":"Arnab Mukherji "},"content":{"0":"Ahead of the debut of The Lord of the Rings' prequel 'Rings of Power' on Amazon's Prime Video, Jeff Bezos revealed a conversation he had with his son. He said, \"My son came up to me one day, he looked me in the eyes, very sincerely, and he said: 'Dad, please don't eff this up'...And he was right.\"","1":"In a letter to staff posted on Snap’s website, CEO Evan Spiegel has confirmed 20% job cuts at the company as the latest quarterly revenue growth of 8% was \"well below\" expectations. Spiegel wrote, \"Unfortunately, given our current lower rate of revenue growth, it has become clear that we must reduce our cost structure to avoid incurring significant ongoing losses.\"","2":"State-owned fuel retailers on Thursday announced a reduction in the prices of commercial LPG cylinders. From today, a 19-kg commercial LPG cylinder will be cheaper by ₹91.50 in Delhi and will be available for ₹1,885 instead of the earlier ₹1,976.50. Apart from Delhi, the prices have been reduced by up to ₹100 in Kolkata, Chennai and Mumbai.","3":"The chairman of Russia's second-largest oil producer Lukoil died on Thursday after falling from a hospital window, as per reports. Ravil Maganov, 67, was being treated at the city's Central Clinical Hospital and died from his injuries, reported Russian media. Maganov is the second top executive at Lukoil to die under mysterious circumstances in recent months.","4":"SpiceJet shares declined nearly 15% during Thursday’s intraday trade to a one-month low after the airline reported widening of net loss to ₹789 crore in the June quarter. Notably, its CFO Sanjeev Taneja also resigned amid losses and a series of mid-air incidents. SpiceJet stock, which has fallen over 36% so far this year, was currently trading at ₹44.15.","5":"The Goods and Services Tax (GST) revenue increased by 28% to ₹1,43,612 crore in August as against ₹1,12,020 crore in the corresponding month last year, the Finance Ministry said. GST revenue crossed the ₹1.40 lakh crore mark for the sixth consecutive month led by robust economic recovery and compliance, the ministry added. The growth till August 2022 is 33% y-o-y.\n","6":"SpiceJet employees have alleged a delay in their salaries for the second consecutive month. Meanwhile, the airline said that the salaries will be credited in a \"graded format\". In an internal communication, mentioning the delay, SpiceJet said the \"previous few months have been difficult\" due to a \"superlative fuel price hike\" and also a \"historically lean period of July-September\".","7":"Value of digital payment transactions through UPI touched an all-time high of ₹10.73 lakh crore with 657 crore transactions in August 2022, according to National Payments Corporation of India's (NPCI) latest data. UPI transaction value in July was at ₹10.63 lakh crore with 628 crore transactions. UPI transaction value crossed the ₹10-lakh-crore mark for the first time in May.","8":"Taiwan President Tsai Ing-wen told the governor of the US state of Arizona, Doug Ducey, that the island nation is looking forward to producing \"democracy chips\" with the US. Taiwan Semiconductor Manufacturing Co Ltd (TSMC) is constructing a $12 billion plant in Arizona. Ducey told Tsai that partnership with Taiwan was \"the greatest\" in the semiconductor industry.","9":"Nasdaq-listed software-as-a-service (SaaS) company Freshworks has appointed Dennis Woodside as the company's President, effective from September 1. Woodside will join the company's board of directors and will report to Freshworks CEO and Founder Girish Mathrubootham. Previously, he was President of Impossible Foods, and also worked at Dropbox and Google. At Freshworks, he will lead global business operations.","10":"The European Commission is looking into measures to cap energy prices and cut electricity demand, Mechthild Wörsdörfer, Deputy Director General of the European Commission's energy department said. She mentioned that European Commission chief Ursula von der Leyen will outline ideas on capping energy prices on September 14. Russia had cut gas deliveries to Europe which led to rise in prices.","11":"The International Monetary Fund (IMF) on Thursday said that it has provisionally agreed to give a loan of about $2.9 billion to Sri Lanka which is grappling with an economic crisis. IMF and Sri Lanka have entered a 48-month-long arrangement under the former's Extended Fund Facility. The agreement is subject to approval by the IMF management and its Executive Board.\n","12":"The yen fell to its lowest to 139.59 per dollar in Thursday’s trading recording a 24-year low as US Treasury yields surged through 3.2% owing to the Federal Reserve’s hawkish stance at the Jackson Hole symposium. During the 1998 Asian financial crisis, the yen had reached around 146 to the dollar. Japan had previously intervened at levels around 130.","13":"German airline Lufthansa has said that it will cancel almost all passenger and cargo flights on Friday from Frankfurt and Munich amid a wage dispute. The pilots' union Vereinigung Cockpit demanded 5.5% pay raise this year for more than 5,000 pilots. However, the union's spokesperson said, \"We have not received a sufficient offer...this is sobering and a missed opportunity.\"","14":"The unemployment rate for people in the age group of 15 years and above in urban areas dropped to 7.6% during April-June 2022 from 12.6% in the corresponding period last year, the National Statistical Office (NSO) said. This was led by an improved labour force participation ratio, pointing towards a sustained economic recovery after the COVID-19 pandemic.\n","15":"The National Payments Corporation of India (NPCI) is reportedly in talks to acquire a 10% stake in Open Network for Digital Commerce (ONDC), India's open source platform for e-commerce. Reportedly, the Bank of India is also looking to acquire a 5-7% stake in the company. ONDC currently has 17 stakeholders and is aiming to have 20. ","16":"SpiceJet's Chief Financial Officer (CFO) Sanjeev Taneja resigned from his post amid the airline reporting a widening of net loss to ₹789 crore during the April-June quarter, on Wednesday. The loss in the corresponding period last fiscal was ₹729 crore. SpiceJet said that its Board has identified a candidate for Taneja's replacement and the vacancy would be filled in September.\n","17":"After the Centre increased the windfall profit tax on the export of diesel and aviation turbine fuel, the shares of Indian fuel exporters dropped up to 3% in the morning trade on Thursday. ONGC declined by 2.2%, Reliance Industries Limited fell by 1.5%, Chennai Petroleum Corporation Limited by 3.3%, Mangalore Refinery & Petrochemicals by 1.5% and Oil India dropped 0.5%.\n","18":"The benchmark indices ended in the red on Thursday with Sensex falling 770.48 points to 58,766.59. Nifty ended 216.5 points lower at 17,542.80 dragged by IT, metal, power and oil and gas stocks. Hindalco Industries, Reliance Industries, ONGC and TCS were among the top Nifty losers, while stocks of Tata Consumer Products, Bajaj Finserv, Asian Paints and Eicher Motors gained.\n","19":"The government has increased the windfall profit tax on the export of diesel to ₹13.5 per litre from ₹7, while that on aviation turbine fuel exports to ₹9 per litre from ₹2. The tax on domestically-produced crude oil has also been hiked by ₹300 per tonne to ₹13,300. The prices come into effect from Thursday, a Finance Ministry notification said.","20":"Benchmark indices opened in the red on Thursday with Sensex falling 707.39 points at 58,829.68 and Nifty down 200.80 points at 17,558.50. Infosys, SBI Life Insurance, TCS, Hindalco Industries, ONGC were among the major Nifty losers, while the shares of Bharti Airtel, Bajaj Auto, IndusInd Bank, Bajaj Finserv and UltraTech Cement gained. Nearly 1,101 shares advanced and 1,052 shares declined.","21":"The Centre's fiscal deficit was 20.5% of the annual target in July end as against 21.3% in the year-ago period, the Controller General of Accounts data showed. The fiscal deficit was ₹3.40 lakh crore during the April-July period in actual terms. For the full FY23, the fiscal deficit is pegged at ₹16.6 lakh crore or 6.4% of the GDP.","22":"Global credit rating agency Moody's Investors Service cut India's economic growth projection to 7.7% for 2022 from its May projection of 8.8%. It said that the economic momentum will slow down on a sequential basis owing to rising interest rates, uneven monsoon and slowing global growth. However, the rating agency said the services and manufacturing sectors have seen robust upswings.","23":"Two senior advertising executives at Snap quit hours after a report emerged stating that the company was planning to cut about 20% of its workforce. Earlier, a report by The Verge, while citing sources, said that Snap is planning to lay off 20% of its more than 6,400 employees after it reported weak Q2 results. ","24":"Former and current Google employees protested outside its offices in San Francisco and called for it to end Project Nimbus, a $1.2 billion contract with Israel which includes Amazon as well. An employee said workers went public after their concerns were met with silence internally. Additional demonstrations are planned on September 8 in New York, Bay Area and Seattle.","25":"In a letter to staff posted on Snap’s website, CEO Evan Spiegel has confirmed 20% job cuts at the company as the latest quarterly revenue growth of 8% was \"well below\" expectations. Spiegel wrote, \"Unfortunately, given our current lower rate of revenue growth, it has become clear that we must reduce our cost structure to avoid incurring significant ongoing losses.\"","26":"Tesla CEO Elon Musk is seeking to delay the trial with Twitter until November, as per court filings. The five-day trial is currently scheduled to start on October 17. The court filings came after Musk's legal team sent a fresh letter to Twitter to include whistleblower Peiter Zatko's claims as another reason to end the $44 billion deal.","27":"Facebook’s Gaming app for iOS and Android is shutting down and will no longer be available for download from October 28, 2022. The Meta-owned company didn't specify the reason for shutting down the app. While Facebook Gaming was introduced in 2018, it took the service two years to develop a mobile app. \n","28":"The total number of electric vehicles (EV) on Indian roads is likely to reach 45 to 50 million by 2030, according to a report by consultancy firm KPMG. As per the Ministry of Road Transport and Highways, there are currently 13,92,265 EVs plying on Indian roads and EV sales in India have seen a three-time growth over the past year.","29":"Social media giant Meta had taken action against 2.5 crore posts on Facebook and 20 lakh posts on Instagram in July in India under the Information Technology Rules, 2021, it said. Action was taken against 1.73 crore spam content, 27 lakh posts related to \"adult nudity and sexual activity\" and 23 lakh \"violent and graphic content\" related content on Facebook.","30":"SoftBank Group's Corporate Officer and Executive Vice President Rajeev Misra is stepping down from his roles, the Japanese conglomerate said on Wednesday. This development follows a record loss at the Japanese investment group after a slide in technology stocks. Misra will retain his position as head of SoftBank Investment Advisers, which oversees the first Vision Fund's existing investments.\n","31":"Microsoft President Brad Smith on Thursday said technology can help solve some of India's biggest challenges like climate change and food security. \"I'm in India as the country celebrates 75 years of Independence. It's an exciting time to learn more about...how India's innovation is shaping future,\" Smith said. He'd earlier said India will become the global superpower in artificial intelligence. ","32":"Japan's Ministry of Economy, Trade and Industry said that the country needs an investment worth over $24 billion from the public and private sectors to develop a competitive manufacturing base for batteries used in electric vehicles (EVs). A specialist panel has set a target of securing 30,000 trained workers for battery manufacturing and supply chains by 2030.\n","33":"Apple has released an iOS 12.5.6 update for older iPhone, iPod touch and iPad models that are not able to run iOS 13 or newer updates. The update fixes the WebKit vulnerability, which was already fixed in iOS 15.6.1 and iPadOS 15.6.1. It is available for iPhone 5s, iPhone 6, iPhone 6 Plus and iPad Air, among others.","34":"Cybercrime cases reported in India in 2021 rose by 5% compared with 2020 and fraud was the most common cybercrime motive, according to National Crime Records Bureau's latest data. While charge sheets were filed in only one-third of such cases, the states of Assam, Karnataka, Telangana and UP reported over 70% of cybercrimes. India reported 52,974 cybercrime cases in 2021.","35":"Taiwan President Tsai Ing-wen told the governor of the US state of Arizona, Doug Ducey, that the island nation is looking forward to producing \"democracy chips\" with the US. Taiwan Semiconductor Manufacturing Co Ltd (TSMC) is constructing a $12 billion plant in Arizona. Ducey told Tsai that partnership with Taiwan was \"the greatest\" in the semiconductor industry.","36":"Meta is setting up a new group to create more paid products and features for Facebook, Instagram and WhatsApp. \"Any new product will be complementary to our existing ads business,\" a Meta spokesperson told Reuters on Wednesday. The group, named New Monetization Experiences, will be reportedly led by the company's former head of research Pratiti Raychoudhury.","37":"Google has launched a new Vulnerability Rewards Program (VRP) to reward researchers for finding bugs in its open source projects. The rewards will range from $100 to $31,337, with larger amounts to be given for finding bugs in most sensitive projects like Angular and Golang. Google said it has given over $38 million through its existing VRP programs so far.","38":"Infosys said that it has divested its stake in Trifacta Inc, a data preparation software company, for $12 million. Infosys had invested $4 million in the San Francisco-based company in 2016. It had a minority holding not exceeding 20% of Trifacta's outstanding share capital. Trifacta was founded in 2012 and its investors include Accel, Greylock Partners, Ignition and Cathay Innovation.\n","39":"Netflix on Tuesday announced that it has hired two top executives from Snap Inc. The firm's Chief Business Officer Jeremi Gorman has been hired as Netflix's head of worldwide advertising while Snap Inc's VP of advertising sales Peter Naylor has been hired for the same role. The hiring signals Netflix's commitment to building an ad-supported version of its streaming service.","40":"Microsoft's cloud computing changes faced criticisms from Amazon and Google on Tuesday with both saying that the changes discourage customers from switching to rival cloud service providers thereby limiting competition. After cloud service providers complained to the EU antitrust regulators against Microsoft, it announced amended licensing deals and changes that will be brought in on October 1.\n","41":"Indian Computer Emergency Response Team (CERT-In) has advised users to immediately update Mozilla Firefox browsers to avoid various vulnerabilities. The bugs in the browser could allow a remote attacker to bypass security restrictions, execute arbitrary code and cause denial of service attack on the targeted system, CERT-In said. Vulnerabilities exist due to abuse of XSLT error handling, it added.","42":"Google has launched a new Vulnerability Reward Program under which it'll award up to $31,337 (nearly ₹25 lakh) to researchers who spot vulnerabilities in Alphabet and Google's Open Source projects. The rewards will range from $100 to $31,337. The larger amounts will go to unusual or particularly interesting vulnerabilities, \"so creativity is encouraged\", Google said while launching the programme.","43":"Apple CEO Tim Cook has announced support for Pakistan amid the devastating floods. \"Apple will donate to relief and recovery efforts on the ground,\" he said. Activist Malala Yousafzai thanked the Apple CEO for \"providing support to Pakistan in this very difficult time\". One-third of Pakistan has been completely submerged by historic flooding, which has killed at least 1,191 people.  ","44":"Nvidia and AMD have been ordered by US officials to stop selling some of their high-performance chips to China that can be used for artificial intelligence (AI). This would affect export of Nvidia's A100 and H100 chips and AMD's MI250 chips to China. The restrictions would also cost Nvidia up to $400 million (nearly ₹3,181.5 crore) in potential sales.","45":"According to a research by Check Point Research, a malware created by Turkish firm Nitrokod has reportedly been used since 2019 to mine crypto on nearly 1.12 lakh users' personal computers (PCs) without their permission. Hackers wait for a month after the app is installed to start mining crypto to ensure the user doesn't notice changes in PC's power consumption.","46":"Tesla took to Instagram and Twitter to share pictures of its field quality engineers testing SUVs in Dubai. The company said the \"extreme heat and durability testing\" was conducted during hottest time of the year in Dubai when temperatures reach over 50°C. According to the pictures, Model X Plaid and Model Y were among the vehicles included in the test.","47":"The Enforcement Directorate in its chargesheet has said that actress Jacqueline Fernandez \"knowingly and deliberately deleted all the data\" with respect to conman Sukesh Chandrashekhar from her phones with an aim to \"hamper the investigation\" to save herself and her family. She allegedly also requested her staff to delete data related to Sukesh from their phones. ","48":"Rajeev Sen and Charu Asopa, who had earlier confirmed their separation, have decided to call off their divorce. Sharing a picture on Instagram, Charu wrote, \"Happy to announce that we have decided to keep our marriage for good.\" \"We both are blessed with a beautiful daughter...Her upbringing & happiness is our number one priority,\" she added. ","49":"Punjabi singer Nirvair Singh was killed in a crash in Australia on Tuesday, according to 9News. The father-of-two was caught in a three-vehicle collision near Melbourne caused by a speeding Kia sedan, the outlet further said quoting the police. The 23-year-old driver of the sedan has been arrested and charged. Singh, 42, was on his way to a job site.","50":"Aamir Khan Productions on Thursday posted and later deleted a video on the occasion of the Jain festival of Samvatsari. The video, which started with the phrase 'Micchami Dukkadam', carried a Hindi voiceover that said, “Hum sab insane hai…Aur galtiyan humse...hoti hai.\" It further said that if I've ever hurt your feelings, then I ask for forgiveness.","51":"Ahead of the debut of The Lord of the Rings' prequel 'Rings of Power' on Amazon's Prime Video, Jeff Bezos revealed a conversation he had with his son. He said, \"My son came up to me one day, he looked me in the eyes, very sincerely, and he said: 'Dad, please don't eff this up'...And he was right.\"","52":"Actor Nagarjuna has said that he wants to keep working till he can. \"At this stage of my life, I don't have to work for stardom or money...except job satisfaction,\" he stated. Nagarjuna added, \"My father literally died with his boots on. He collapsed on the set of a film. For an actor what can be better than that?\"","53":"Actress Kriti Sanon said one of the reasons why she wouldn't date actor Kartik Aaryan is because she knows him \"too well\". Kriti added that a reason why she'd date Kartik is because she knows him well. Talking about actor Tiger Shroff, Kriti stated that one of the reasons she wouldn't date the actor is because he \"flips too much\".","54":"Responding to a question by Karan Johar over her thoughts on actress Alia Bhatt being the best actress currently, actress Kriti Sanon said, \"[Alia's work] drives me.\" \"It inspires me to do better when I see great work. I would love to have an opportunity like 'Gangubai Kathiawadi',\" she added. Recently, Kriti won Best Actress at Filmfare Awards for 'Mimi'.  ","55":"'Bigg Boss 16' makers have reportedly locked the premiere date of its upcoming season. The makers of the Salman Khan-hosted reality show are reportedly planning to lock either October 8 or October 9 for Bigg Boss 16's premiere. Earlier, the new season was supposed to launch on October 1, but the makers decided to push it for a week. ","56":"Tamil actor Chiyaan Vikram has shared that he would like to work with his contemporary Vijay under the direction of filmmaker Ajay Gnanamuthu. Vikram spoke about Vijay during a Twitter conversation, which was conducted on Tuesday to promote his film 'Cobra'. In response, director Ajay Gnanamuthu said he would be the first person to buy a ticket for the film. ","57":"Actor Kartik Aaryan has revealed that his dreams are getting bigger and said that his wishes of buying a Lamborghini and becoming an actor were fulfilled. Kartik was asked if he now dreams of buying a private jet. To this, he replied, \"Private jet should also come...I don't have to prove that I come from Gwalior and that I'm relatable.\"","58":"Filmmaker Ram Gopal Varma has revealed the immediate feedback of the 1998 film 'Dil Se..' was negative. \"The exhibitors felt that killing Shah Rukh Khan was a mistake. They told us that due to the tragic ending, the viewers are giving the film thumbs down,\" he added. Varma, who was one of the film's producers, stated they were all panicking.  ","59":"Actor Markand Soni said working with actors Ranbir Kapoor and Amitabh Bachchan was a \"100%\" dream come true. \"I've never met someone as kind and as sweet as Ranbir Kapoor and Amitabh Bachchan sir,\" he added. Soni further called them grounded. '''Brahmastra' is going to be like something you have never seen before in the Hindi film industry,\" he added.","60":"South Korea is considering a survey to determine whether members of K-pop band BTS should be granted exemptions from mandatory military service, officials said. The Defence Ministry is examining the adequacy of such a study. The military service issue has been debated in the media recently as BTS's oldest member, Jin, faces enlistment at year-end, when he turns 30.","61":"Kiara Advani said she \"learned how to face the camera\" from her 'Good Newwz' co-star Kareena Kapoor Khan. She said during the film's shoot, she used to be so involved in a scene that she would forget about camera angles. However, that never happened with Kareena. Kiara said Kareena \"would know where the camera is, even if it's behind her\".","62":"Actress Sargun Mehta, who will be making her Bollywood debut with 'Cuttputlli', said, \"I always wanted my debut to be a role which makes a difference to the story irrespective of the length.\" She added the subject of the film was \"very interesting\". Sargun stated, \"I was getting an opportunity to work with Akshay Kumar, who is a brilliant actor.\"","63":"Amitabh Bachchan said he has tested negative for COVID-19 and is \"back at work\". He also expressed his gratitude to his fans for their prayers and concern. A source informed Indian Express that Amitabh has resumed 'Kaun Banega Crorepati 14' shoot, and this time, the reality show's producers have made COVID-19 safety protocols \"a little stricter\" on sets. ","64":"Film producer Mahaveer Jain said that he was \"very fortunate\" to meet Prime Minister Narendra Modi. Speaking about PM Modi, Mahaveer said, \"He is a very strong personality yet very sensitive and emotional at heart.\" Jain further added, \"He himself is a very creative person who admires the creative fraternity for its positive contribution.\"","65":"Filmmaker Karan Johar said he tried to engage in \"matchmaking\" during one of his parties by asking actor Sanjay Kapoor's daughter Shanaya Kapoor to speak to actor Tiger Shroff. \"After ten minutes, Shanaya came...and said, 'I think he's really bored of me',\" added Johar. Tiger responded by stating that he's feeling very ''bad\", adding he thought he was being cool.","66":"Actor Chiranjeevi said the number of people coming to theatres has gone down after the pandemic. However, he added people will come if the film's script is good. \"The bad films get rejected on the second day of their release. I'm one of the victims of this trend,\" he added. Chiranjeevi's 'Acharya' failed to perform at the box office.","67":"During the quiz round in the 'Koffee With Karan 7' episode featuring Kriti Sanon and Tiger Shroff, Karan Johar asked them to name the actress who played both Amitabh Bachchan's mother and love interest in films. Tiger replied, \"Rekha ma'am?\" Reacting to this, Karan said, \"What? She never...played his mother.\" Karan revealed the actresses were Waheeda Rehman and Rakhee.","68":"Actor Riteish Deshmukh and his wife Genelia Deshmukh bought BMW iX electric car on Ganesh Chaturthi. The two, along with their kids Riaan and Rahyl, were seen arriving at Arpita Khan Sharma and Aayush Sharma's house in their new car, which costs around ₹1.43 crore. The new model is the first-ever all-electric variant of the iX. ","69":"Actor-comedian Krushna Abhishek has said that 'The Kapil Sharma Show' is his show as well and revealed that he will be back again. Speaking about the rumours about the tension between him and Kapil Sharma, Krushna said, \"There is no issue.\" This comes as Krushna had previously said he will not be featuring in the show due to \"agreement issues\".","70":"Talking about his reaction after his recent film didn't perform well, during his appearance on 'Koffee With Karan 7', actor Tiger Shroff said, \"I was heartbroken. I was depressed.\" \"I'm just a very extreme person, I wouldn't say I sacrificed a lot because I like what I do,\" he further added. The actor's recent film 'Heropanti 2' failed to perform.","71":"Actor Kartik Aaryan, during an interview, was asked if he lied about his relationship with Sara Ali Khan after Karan Johar confirmed his relationship on 'Koffee With Karan'. To this, he replied, \"I've been single [for] the past 1.25 years, I don't know about anything else.\" Kartik and Sara were rumoured to be dating while filming 'Love Aaj Kal 2'.","72":"India beat Hong Kong by 40 runs to qualify for Super 4 stage of Asia Cup 2022. Suryakumar Yadav slammed 68*(26), the highest score by a batter in the ongoing tournament. He also recorded most sixes by an Indian (six) in a T20 Asia Cup match and most runs by an Indian (26) in 20th over of a T20I match.","73":"Suryakumar Yadav on Wednesday broke the record for smashing the most number of sixes by a Team India batter in a men's T20 Asia Cup match. Suryakumar slammed six sixes against Hong Kong on Wednesday. No other Indian batter has slammed more than three sixes in a men's T20 Asia Cup match. Suryakumar scored 68*(26) against Hong Kong.","74":"Hong Kong batter Kinchit Shah proposed to his girlfriend in the stadium after his team's Asia Cup 2022 match against India in Dubai on Wednesday. A video went viral showing Kinchit going down on one knee and offering the ring to his girlfriend, who accepted his proposal. Fans and his teammates were seen cheering for him during the proposal.","75":"With their 40-run victory against Hong Kong in Asia Cup 2022, India confirmed a first-place finish in Group A and advanced to Super 4. Pakistan and Hong Kong, who'll face each other on Friday, are placed second and third, respectively. Meanwhile, Afghanistan are on top of Group B points table, with Bangladesh and Sri Lanka being second and third, respectively. ","76":"On being asked about Virat Kohli bowing down to him and asking him to walk out of the field first after his knock of 68*(26) against Hong Kong, Suryakumar Yadav said, \"It was a heartwarming gesture.\" He added, \"I've never seen something like this. I was wondering why he wasn't leaving the field. I loved batting with him.\"","77":"Hong Kong gifted a jersey with a handwritten message on it to Virat Kohli following their Asia Cup match against India. Kohli took to his Instagram Stories to share a picture of the jersey. \"Virat...Thank you for inspiring a generation. We stand with you! There are many incredible days ahead. With strength, with love, Team Hong Kong,\" the message read.","78":"Defending champions Australia have announced their squad for T20 World Cup 2022. Batter Tim David has been included in the 15-member squad. His selection over leg-spinner Mitchell Swepson is the only change from the group that won the T20 World Cup 2021 in the UAE. Australia's T20 World Cup 2022 campaign will begin against New Zealand on October 22.","79":"Reacting to KL Rahul's 39-ball 36-run knock against Hong Kong, former India fast bowler Venkatesh Prasad tweeted, \"Is there something in the pitch that is not visible?\" He added, \"Simply can't fathom this approach especially from KL Rahul.\" India scored 70 runs in their first 10 overs against Hong Kong, but went on to put up a total of 192\/2.","80":"After a journalist asked Suryakumar Yadav if he'd open with Rohit Sharma at some point in Asia Cup, Suryakumar Yadav jokingly replied, \"Are you saying...KL Rahul should be dropped?\" He added, \"I'm really flexible to bat at any number. I've told coach and captain that they can play me at any number but I want to be in the team.\"","81":"Former Team India captain Virat Kohli on Wednesday bowled an over against Hong Kong in their Asia Cup 2022 match. It is the first time since 2016 that Kohli bowled in a T20I match. He gave away six runs in his over. Kohli has bowled 25.2 overs in T20I cricket, taking four wickets for 204 runs.","82":"Ex-India opener Gautam Gambhir has said he wouldn't have agreed to have Rishabh Pant instead of Hardik Pandya in the playing XI against Hong Kong. \"If you're resting Hardik, then I think Deepak Hooda, who can bowl a couple of overs, deserves a go,\" he added. Gambhir, however, also stated that Rishabh should've played, but in place of Dinesh Karthik. ","83":"Talking about his unbeaten 68*(26) against Hong Kong in Asia Cup, Suryakumar Yadav said, \"Before [going] out to bat, I spoke to Rohit...and told [him] I'd try to take the tempo up.\" Suryakumar came in to bat when India were 94\/2 after 12.6 overs and added 98 runs with Virat Kohli. The 31-year-old smashed four sixes in the final over.","84":"Discussing the performance of Team India pacers Avesh Khan and Arshdeep Singh against Hong Kong, ex-India all-rounder Reetinder Singh Sodhi said, \"If you get hit by Hong Kong, then it won't let you sleep that night.\" \"Arshdeep was missing the radar and Avesh was expensive,\" added Reetinder. Arshdeep conceded 44 runs against Hong Kong with Avesh giving away 53 runs.","85":"Defending champion and world number one Daniil Medvedev entered the third round of the ongoing US Open 2022 after defeating Frenchman Arthur Rinderknech in straight sets. Medvedev won with a scoreline of 6-2, 7-5, 6-3 in two hours and 11 minutes. \"In general, I'm happy with my level in the third set, so that's great,\" said Medvedev after the match.","86":"Bangladesh Team Director Khaled Mahmud has reacted to Sri Lanka captain Dasun Shanaka's remark that Bangladesh have \"only two world-class bowlers\" in their team. Khaled said, \"I don't see any in Sri Lanka, at least Bangladesh have two. That's very good.\" Dasun made the remark after losing against Afghanistan, claiming that Bangladesh would be an \"easier opponent\" in Asia Cup.","87":"Shuttler HS Prannoy has entered the quarterfinals of the ongoing Japan Open Super 750 tournament after defeating 2021 men's singles world champion Loh Kean Yew of Singapore. Prannoy won with a scoreline of 22-20, 21-19 in a 44-minute second-round match. The 30-year-old Indian will next face Chinese Taipei's Chou Tien Chen in the last-eight stage.","88":"Australian tennis player Nick Kyrgios has entered the third round of the ongoing US Open 2022 after defeating Frenchman Benjamin Bonzi 7-6(7-3), 6-4, 4-6, 6-4. \"I was hanging by a thread. His level today was incredible...I played some really risky tennis late in the fourth, which paid off,\" said Kyrgios. He'll now face American JJ Wolf in the third round.","89":"During her on-court interview after defeating world number two Anett Kontaveit in her US Open second-round match, Serena Williams said, \"This is what I do best.\" She added, \"I'm just Serena...I'm super competitive...I'm just looking at it as a bonus.\" The twenty three-time singles' Grand Slam champion had earlier stated she'll be \"evolving away\" from tennis following the US Open. ","90":"Referring to KL Rahul and Virat Kohli's innings against Hong Kong, former India cricketer Saba Karim has said India could've scored 15-20 more runs in the match but the team needs to \"nurture\" the experienced players once they come back after a break. \"If you expect too much too soon, it will create problems for your own team,\" added Karim","91":"Ex-India cricketer Irfan Pathan has said KL Rahul's 36-run innings, Virat Kohli's half-century, Suryakumar Yadav's batting and Ravindra Jadeja's bowling were some of the positives from India's Asia Cup match against Hong Kong. \"Kohli's half-century is the biggest positive because of the way he batted...You see the score but we here see how he played...he [was] in control,\" added Irfan. ","92":"Discussing Team India opener KL Rahul's 36 off 39 balls in the Asia Cup match against Hong Kong, Gautam Gambhir said, \"Rahul has so much ability...Only he can stop himself if he doesn't play freely.\" \"I won't hesitate to say that...he probably has more ability than Rohit Sharma...He's shown that by doing it in international cricket,\" added Gambhir.","93":"Ex-Australia captain Ricky Ponting has said he wants to see Virat Kohli among the leading run scorers in the upcoming T20 World Cup in Australia. \"But just make sure he doesn't score many runs against Australia,\" Ponting added jokingly. \"The fact that Kohli [took] that month off...to get himself back...There're a lot of good signs there,\" he further said.","94":"India captain Rohit Sharma said \"words will be short\" to describe Suryakumar Yadav's unbeaten 68-run innings against Hong Kong in their Asia Cup match on Wednesday. \"We've seen that with Suryakumar every now and then. He comes up with [such] kinds of knocks. He just comes out and bats fearlessly which is what the team expects from him,\" added Rohit. ","95":"Ex-India opener Gautam Gambhir has said Hong Kong are not the right opposition to judge whether Virat Kohli is back in \"rhythm\". He added, \"I hope Kohli will be seen in better rhythm in upcoming matches because it was not that sort of quality bowling.\" Kohli scored unbeaten 59 runs off 44 balls in the match. ","96":"Discussing her 7-6(4), 2-6, 6-2 win against second seed Anett Kontaveit to enter US Open's third round, Serena Williams said, \"After losing the second set, I thought 'Oh, my goodness'.\" \"I had to give my best...because 'this could be it',\" Serena added. \"I don't have anything to lose. I've had an X on my back since 1999,\" she stated."}}