{"genre":{"0":"business","1":"business","2":"business","3":"business","4":"business","5":"business","6":"business","7":"business","8":"business","9":"business","10":"business","11":"business","12":"business","13":"business","14":"business","15":"business","16":"business","17":"business","18":"business","19":"business","20":"business","21":"business","22":"business","23":"business","24":"business","25":"technology","26":"technology","27":"technology","28":"technology","29":"technology","30":"technology","31":"technology","32":"technology","33":"technology","34":"technology","35":"technology","36":"technology","37":"technology","38":"technology","39":"technology","40":"technology","41":"technology","42":"technology","43":"technology","44":"technology","45":"technology","46":"technology","47":"technology","48":"technology","49":"technology","50":"entertainment","51":"entertainment","52":"entertainment","53":"entertainment","54":"entertainment","55":"entertainment","56":"entertainment","57":"entertainment","58":"entertainment","59":"entertainment","60":"entertainment","61":"entertainment","62":"entertainment","63":"entertainment","64":"entertainment","65":"entertainment","66":"entertainment","67":"entertainment","68":"entertainment","69":"entertainment","70":"entertainment","71":"entertainment","72":"entertainment","73":"entertainment","74":"entertainment","75":"sports","76":"sports","77":"sports","78":"sports","79":"sports","80":"sports","81":"sports","82":"sports","83":"sports","84":"sports","85":"sports","86":"sports","87":"sports","88":"sports","89":"sports","90":"sports","91":"sports","92":"sports","93":"sports","94":"sports","95":"sports","96":"sports","97":"sports","98":"sports","99":"sports"},"publish_date":{"0":"31 Aug","1":"31 Aug","2":"31 Aug","3":"31 Aug","4":"31 Aug","5":"31 Aug","6":"31 Aug","7":"31 Aug","8":"31 Aug","9":"31 Aug","10":"31 Aug","11":"31 Aug","12":"30 Aug","13":"31 Aug","14":"31 Aug","15":"31 Aug","16":"31 Aug","17":"31 Aug","18":"31 Aug","19":"31 Aug","20":"31 Aug","21":"31 Aug","22":"31 Aug","23":"31 Aug","24":"31 Aug","25":"31 Aug","26":"30 Aug","27":"30 Aug","28":"31 Aug","29":"31 Aug","30":"31 Aug","31":"31 Aug","32":"31 Aug","33":"30 Aug","34":"30 Aug","35":"30 Aug","36":"30 Aug","37":"31 Aug","38":"31 Aug","39":"30 Aug","40":"31 Aug","41":"31 Aug","42":"31 Aug","43":"30 Aug","44":"31 Aug","45":"30 Aug","46":"30 Aug","47":"30 Aug","48":"31 Aug","49":"31 Aug","50":"31 Aug","51":"31 Aug","52":"31 Aug","53":"31 Aug","54":"31 Aug","55":"31 Aug","56":"31 Aug","57":"31 Aug","58":"31 Aug","59":"31 Aug","60":"31 Aug","61":"31 Aug","62":"31 Aug","63":"31 Aug","64":"31 Aug","65":"31 Aug","66":"31 Aug","67":"31 Aug","68":"31 Aug","69":"31 Aug","70":"31 Aug","71":"31 Aug","72":"31 Aug","73":"31 Aug","74":"31 Aug","75":"31 Aug","76":"31 Aug","77":"31 Aug","78":"31 Aug","79":"31 Aug","80":"31 Aug","81":"31 Aug","82":"31 Aug","83":"31 Aug","84":"31 Aug","85":"31 Aug","86":"31 Aug","87":"31 Aug","88":"31 Aug","89":"31 Aug","90":"31 Aug","91":"31 Aug","92":"31 Aug","93":"31 Aug","94":"31 Aug","95":"31 Aug","96":"31 Aug","97":"31 Aug","98":"31 Aug","99":"31 Aug"},"source":{"0":"Twitter","1":"Reuters","2":"Reuters","3":"Reuters","4":"News18","5":"Times Now ","6":"Times Now","7":"Reuters","8":"Reuters","9":"CNBC-TV18","10":"Reuters","11":"Moneycontrol","12":"Moneycontrol","13":"YourStory","14":"Moneycontrol","15":"The Print","16":"Moneycontrol","17":"Times Now","18":"CNBCTV18","19":"Moneycontrol","20":"CNBC-TV18","21":"Times Now","22":"Financial Express","23":"Moneycontrol","24":"CNBC-TV18","25":"Reuters","26":"Reuters","27":"Reuters","28":"Reuters","29":"Reuters","30":"Reuters","31":"Digit","32":"Times Now","33":"Reuters","34":"Reuters","35":"CNBC TV18","36":"Financial Express","37":"Reuters","38":"CNBC-TV18","39":"Google","40":"CNBC-TV18","41":"Reuters","42":"Financial Express","43":"Moneycontrol","44":"Financial Express","45":"Reuters","46":"Digit","47":"News18","48":null,"49":null,"50":"Instagram ","51":"Hindustan Times","52":"ANI","53":"The Associated Press","54":"Bollywood Hungama","55":"Outlook India","56":"Outlook India","57":"PINKVILLA","58":"Hindustan Times","59":"Mid-day","60":"PINKVILLA","61":"Outlook India","62":"Free Press Journal","63":"News18","64":"Bollywood Hungama","65":"Outlook India","66":"Hindustan Times","67":"Hindustan Times","68":"Outlook India","69":"Bollywood Hungama","70":"Bollywood Hungama","71":null,"72":null,"73":null,"74":null,"75":"BCCI","76":"ICC","77":"ICC","78":"ICC","79":"Times Now","80":"BCCI","81":"ICC","82":"Hindustan Times","83":"The Independent","84":"BCCI","85":"Times Now","86":"CricTracker","87":"ANI","88":"Sportskeeda","89":"Sportskeeda","90":"Sportskeeda","91":"Sportskeeda","92":"Hindustan Times","93":"Hindustan Times","94":"Hindustan Times","95":"Sportskeeda","96":"Times Now","97":"Hindustan Times","98":"CricTracker","99":"Sportskeeda"},"title":{"0":"India's GDP grows at 13.5% in first quarter of FY23, fastest in a year","1":"Snap to lay off 20% of staff, cancel several projects to cut costs","2":"2 top executives at Snap quit hours after report about 20% layoffs emerges","3":"Musk seeks to delay Twitter trial to Nov amid whistleblower's claims","4":"Viral video shows Amazon parcels thrown out of train at station, Railways clarifies","5":"Dell among firms conducting stay interviews to contain high attrition rates: Report","6":"World's 3rd richest person Adani's wealth surged over 13 times in 2.5 years","7":"Russia's Gazprom halts gas supply to Europe via major pipeline","8":"Japan calls for $24 bn investment to boost battery competitiveness","9":"Infosys divests entire stake in US-based Trifacta for $12 million","10":"Netflix hires 2 top advertising executives from Snapchat-parent Snap Inc","11":"SoftBank Corporate Officer Rajeev Misra steps down amid record loss","12":"Axis Bank looking to acquire 10% stake in Go Digit: Report","13":"Dennis Woodside appointed as President of Freshworks","14":"Tata Motors completes buying of Marcopolo's stake for ₹99.96 crore","15":"States, UTs to get chana at ₹8\/kg discount for welfare schemes","16":"IMF to make formal announcement on SL bailout package on Thurs: Report","17":"Pak at challenging economic juncture: IMF while approving bailout","18":"NPCI receives RBI nod to acquire 10% stake in ONDC","19":"India's B2B general trade to reach $1.2 trillion by 2030: Redseer","20":"Tata Steel to invest in hydrogen-based steel production in Netherlands","21":"Air India retains Captain RS Sandhu as Chief of Operations","22":"Reliance Industries acquires soft drink brand Campa: Report","23":"NSDL likely to shortlist 7 investment banks for 2023 IPO: Reports","24":"FPIs turn net buyers of Indian shares in a month 1st time since Sept 2021","25":"Snap to lay off 20% of staff, cancel several projects to cut costs","26":"Musk cites whistleblower's claims in new notice as reason to end Twitter deal","27":"American man sues Tesla over car suddenly stopping for non-existent obstacles","28":"2 top executives at Snap quit hours after report about 20% layoffs emerges","29":"Facebook's Gaming app to be shut down in October this year","30":"Musk seeks to delay Twitter trial to Nov amid whistleblower's claims","31":"Netflix hires 2 top advertising executives from Snapchat-parent Snap Inc","32":"Google to give ₹25 lakh reward for spotting bugs under new programme","33":"Tesla reveals virtual power plant in Japan with over 300 batteries","34":"Aus asks Facebook, Apple to share anti-abuse plan, threatens fine","35":"Indonesia's GoTo seeks to raise $1 billion via convertible bonds: Report","36":"LinkedIn's chat, job posting tools being used to steal users' data: Report","37":"45-50 million EVs to be on Indian roads by 2030: KPMG","38":"Japan calls for $24 bn investment to boost battery competitiveness","39":"Nazara Technologies acquires US-based WildWorks for $10.4 million","40":"Google to award up to $31,337 in new open source bug bounty program","41":"Infosys divests entire stake in US-based Trifacta for $12 million","42":"Microsoft's cloud computing changes criticised by Amazon, Google","43":"Most of crypto still junk: JP Morgan's digital assets division head","44":"SoftBank Corporate Officer Rajeev Misra steps down amid record loss","45":"Snapchat releases 'Dual Camera' recording tool for iOS users","46":"45 data centres with 1,015 MW IT capacity to come up by 2025-end: Report","47":"Truth Social app hasn't been approved on Google Play Store yet: Report","48":"Update Mozilla Firefox browser to avoid various vulnerabilities: CERT-In to users","49":"Cybercrime cases in 2021 rose by 5%, fraud most common motive: NCRB","50":"Shah Rukh Khan celebrates Ganesh Chaturthi, shares pic of Lord Ganesha idol at home","51":"Jacqueline knew about Sukesh's criminal past & wife, cooked up a false story: ED","52":"Jacqueline Fernandez summoned by Delhi court in ₹200 crore extortion case","53":"Aamir Khan to not charge fee for Laal Singh Chaddha as film to lose ₹100 crore: Report","54":"S Korea may hold survey on BTS members' mandatory military service","55":"Mike Tyson was paid around ₹25 crore for 'Liger': Reports","56":"Michael Jackson wanted to be in The Sandman's TV version: Neil Gaiman","57":"Learned how to face camera from Kareena: Kiara","58":"Ty Burrell was meant to officiate Sarah Hyland's wedding: Jesse Tyler","59":"I have lost 65% of my investment, it's a sabotage: 'Liger' distributor","60":"'Brahmastra' to decide budget of 'The Immortal Ashwatthama': Reports","61":"Would like to work with Vijay in Ajay Gnanamuthu directorial: Vikram","62":"Nikhil Siddhartha's 'Karthikeya 2' crosses ₹100 crore at box office","63":"Response to 'Delhi Crime 2' is enormous: Actress Shefali Shah","64":"Ramya launches her own production house, announces comeback to films","65":"Have to see if I should keep Gaiety and Galaxy shut till Sep 9: Manoj","66":"Dharmendra had tears after knowing I was turned away from his home: Gippy","67":"Mouni Roy confirms Shah Rukh Khan's guest appearance in 'Brahmastra'","68":"Allu Arjun's 'Pushpa: The Rise' screened at Moscow Film Festival","69":"Judge 'The Kashmir...' according to its cinematic merit: Pallavi on Oscar bid","70":"We have been inviting Bappa for almost 60 years now: Shraddha Kapoor","71":"Kartik gets 1st darshan at Lalbaugcha Raja, thanks him for 'life-changing year'","72":"Mom didn't let me do 'Lust...' as focus was only on sensual scenes: Kriti","73":"Kunal Kemmu announces directorial debut with 'Madgaon Express'","74":"Tiger Shroff asked to slash his fees post 'Heropanti 2' debacle: Reports","75":"India beat Hong Kong to reach Asia Cup Super 4 as Suryakumar breaks multiple records","76":"Suryakumar Yadav smashes most sixes ever by an Indian in a T20 Asia Cup match","77":"Hardik Pandya achieves his highest-ever spot in rankings for T20I all-rounders","78":"India announce their playing XI for match against Hong Kong, Hardik Pandya rested","79":"Indian fan receives death threats for wearing Pakistan jersey during India-Pakistan match","80":"Rohit Sharma becomes first cricketer to reach 3,500 runs in T20I cricket","81":"India, Pakistan players fined 40% of match fee each for slow over-rate offence","82":"I have no idea, this question is out of my book: Jadeja on why Pant didn't play vs Pak","83":"Tennis player Sara responds to criticism over father, coach patting her backside after win","84":"Virat Kohli bowls in T20I cricket after 6 years, concedes 6 runs in an over","85":"Man steals 1-day-old infant from UP hospital by posing as hospital staff, video surfaces","86":"Virat Kohli bows down to Suryakumar Yadav, asks crowd to cheer for him; video goes viral","87":"Plan was to bowl wicket to wicket and it worked: Mujeeb on 3\/16 vs B'desh","88":"I don't think one or two failures will make them drop Rahul: Jaffer","89":"I was surprised by Pant's exclusion from playing XI vs Pak: Parthiv","90":"You're doing grave injustice to him: Aakash on Karthik batting at no. 7","91":"No point in Hardik playing against HK if he isn't going to bowl: Parthiv","92":"David Warner shares Lord Ganesha's pic, extends greetings on Ganesh Chaturthi","93":"Afghanistan capable of 'not letting' India make a comeback: Ajay Jadeja","94":"He never played 'such poor shots' earlier: Sehwag on Kohli's 35 vs Pak","95":"India faced a 'lot of difficulty' when they last played Hong Kong: Jaffer","96":"Pant can get into this side if Rahul doesn't find his form: Saba Karim","97":"I can't believe his place is under threat: Styris on Manjrekar's remark over Kohli","98":"Team India can tackle our bowlers, Pak can't: Ex-Afghanistan captain Asghar","99":"Kohli will score his 71st century vs Hong Kong: SL spinner Theekshana"},"authors":{"0":"Anmol Sharma","1":"Anmol Sharma","2":"Ananya Goyal","3":"Ananya Goyal","4":"Ridham Gambhir","5":"Ridham Gambhir","6":"Ridham Gambhir","7":"Ridham Gambhir","8":"Apaar Sharma","9":"Apaar Sharma","10":"Ridham Gambhir","11":"Ridham Gambhir","12":"Ridham Gambhir","13":"Ridham Gambhir","14":"Srishty Choudhury","15":"Srishty Choudhury","16":"Purnima Rajput","17":"Purnima Rajput","18":"Srishty Choudhury","19":"Srishty Choudhury","20":"Ashley Paul","21":"Ashley Paul","22":"Srishty Choudhury","23":"Srishty Choudhury","24":"Anisha Joneja","25":"Ananya Goyal","26":"Ananya Goyal","27":"Ridham Gambhir","28":"Ridham Gambhir","29":"Anmol Sharma","30":"Anmol Sharma","31":"Ridham Gambhir","32":"Ridham Gambhir","33":"Ridham Gambhir","34":"Ridham Gambhir","35":"Ridham Gambhir","36":"Ridham Gambhir","37":"Ashley Paul","38":"Ashley Paul","39":"Ashley Paul","40":"Ashley Paul","41":"Mansi Agarwal","42":"Mansi Agarwal","43":"Purnima Rajput","44":"Purnima Rajput","45":"Ashley Paul","46":"Ashley Paul","47":"Ashley Paul","48":"Ashley Paul","49":"Purnima Rajput","50":"Daisy Mowke","51":"Daisy Mowke","52":"Daisy Mowke","53":"Daisy Mowke","54":"Apaar Sharma","55":"Apaar Sharma","56":"Apaar Sharma","57":"Apaar Sharma","58":"Indraneel Sen","59":"Indraneel Sen","60":"Kameshwari","61":"Kameshwari","62":"Kameshwari","63":"Kameshwari","64":"Kameshwari","65":"Kameshwari","66":"Amartya Sharma","67":"Amartya Sharma","68":"Arnab Mukherji ","69":"Arnab Mukherji ","70":"Kameshwari","71":"Kameshwari","72":"Kameshwari","73":"Kameshwari","74":"Kameshwari","75":"Anmol Sharma","76":"Anmol Sharma","77":"Anmol Sharma","78":"Anmol Sharma","79":"Anmol Sharma","80":"Anmol Sharma","81":"Anmol Sharma","82":"Anmol Sharma","83":"Anmol Sharma","84":"Anmol Sharma","85":"Anmol Sharma","86":"Anmol Sharma","87":"Anmol Sharma","88":"Anmol Sharma","89":"Anmol Sharma","90":"Anmol Sharma","91":"Anmol Sharma","92":"Anmol Sharma","93":"Anmol Sharma","94":"Anmol Sharma","95":"Anmol Sharma","96":"Anmol Sharma","97":"Anmol Sharma","98":"Anmol Sharma","99":"Ankur Taliyan"},"content":{"0":"India's GDP grew at 13.5% in the first quarter of FY23, achieving its fastest annual expansion in a year, government data showed. However, it is lower than the Reserve Bank of India's (RBI) projection of 16.2% GDP growth in the first quarter of FY23. India's GDP growth in the first quarter of FY22 was 20.1%.","1":"Snap said on Wednesday it will lay off 20% of its staff and shut down original shows, in-app games and several other projects as part of a corporate restructuring. As per CEO  Evan Spiegel, Snap's current revenue growth rate is \"well below\" what the company was expecting. The cut will help Snap save an estimated $500 million in costs annually. ","2":"Two senior advertising executives at Snap quit hours after a report emerged stating that the company was planning to cut about 20% of its workforce. Earlier, a report by The Verge, while citing sources, said that Snap is planning to lay off 20% of its more than 6,400 employees after it reported weak Q2 results. ","3":"Tesla CEO Elon Musk is seeking to delay the trial with Twitter until November, as per court filings. The five-day trial is currently scheduled to start on October 17. The court filings came after Musk's legal team sent a fresh letter to Twitter to include whistleblower Peiter Zatko's claims as another reason to end the $44 billion deal.","4":"A video from Guwahati railway station has gone viral which shows Amazon parcels being thrown on the platform as they are unloaded from a train. After some social media users alleged that Railways' employees were carelessly unloading the parcels, Northeast Frontier Railway said, \"This is an old video from March, 2022...The persons handling parcels are representatives of concerned party.\"","5":"To contain the high attrition rates, some companies are now reportedly using stay interviews. In stay interviews, companies speak to the employees about their importance to the organisation while addressing the issues they might be facing prompting them to quit. Dell Technologies and Ericsson are among the companies which have been conducting such interviews with employees. ","6":"Adani Group Chairman Gautam Adani on Tuesday became the world's third richest person with a net worth of $137 billion. While his wealth stood at $10 billion on January 1, 2020, it surged by over $60 billion in 2022 alone and jumped more than thirteen times in over two and half years. Currently, his net worth stands at $143 billion. ","7":"Russia stopped gas supplies via a major pipeline to Europe on Wednesday with state energy company Gazprom saying that no gas would flow into Germany between Wednesday and Saturday. This is because of the outage for maintenance on Nord Stream 1. While European governments have accused Russia of using energy supplies as a \"weapon of war\", Moscow has denied this.\n","8":"Japan's Ministry of Economy, Trade and Industry said that the country needs an investment worth over $24 billion from the public and private sectors to develop a competitive manufacturing base for batteries used in electric vehicles (EVs). A specialist panel has set a target of securing 30,000 trained workers for battery manufacturing and supply chains by 2030.\n","9":"Infosys said that it has divested its stake in Trifacta Inc, a data preparation software company, for $12 million. Infosys had invested $4 million in the San Francisco-based company in 2016. It had a minority holding not exceeding 20% of Trifacta's outstanding share capital. Trifacta was founded in 2012 and its investors include Accel, Greylock Partners, Ignition and Cathay Innovation.\n","10":"Netflix on Tuesday announced that it has hired two top executives from Snap Inc. The firm's Chief Business Officer Jeremi Gorman has been hired as Netflix's head of worldwide advertising while Snap Inc's VP of advertising sales Peter Naylor has been hired for the same role. The hiring signals Netflix's commitment to building an ad-supported version of its streaming service.","11":"SoftBank Group's Corporate Officer and Executive Vice President Rajeev Misra is stepping down from his roles, the Japanese conglomerate said on Wednesday. This development follows a record loss at the Japanese investment group after a slide in technology stocks. Misra will retain his position as head of SoftBank Investment Advisers, which oversees the first Vision Fund's existing investments.\n","12":"Axis Bank is looking to acquire a 10% stake for around $9 million in Go Digit Life Insurance, as per a report. Last week, HDFC Bank in a regulatory filing declared that it was planning to buy a 9.94% stake in Go Digit Life for $9 million. Go Digit Insurance recently filed papers to raise $440 million via an IPO. ","13":"Nasdaq-listed software-as-a-service (SaaS) company Freshworks has appointed Dennis Woodside as the company's President, effective from September 1. Woodside will join the company's board of directors and will report to Freshworks CEO and Founder Girish Mathrubootham. Previously, he was President of Impossible Foods, and also worked at Dropbox and Google. At Freshworks, he will lead global business operations.","14":"Tata Motors has completed the acquisition of its partner Marcopolo's stake in their joint venture Tata Marcopolo Motors Limited (TMML) for ₹99.96 crore. The 51:49 joint venture between the two was formed in 2006. Tata Motors and Marcopolo had signed a deal under which the former agreed to purchase 49% shareholding of Marcopolo in the joint venture in December 2020.\n","15":"The Union Cabinet has approved the disposal of 15 lakh tonne of chana to states and Union Territories at a discount of ₹8\/kg for utilisation in various welfare schemes. These will be offered on a \"first come, first served\" basis and can be utilised in Mid Day Meal Scheme, Public Distribution System and Integrated Child Development Services, among others.","16":"International Monetary Fund (IMF) is likely to conclude talks with the Sri Lankan government and make a formal announcement on Thursday on the bailout package and staff-level agreement for the cash-strapped country, according to reports. The ongoing talks are regarding a $5 billion bailout package for Sri Lanka. This is IMF delegation's second visit to Sri Lanka in three months.","17":"Pakistan is at a \"challenging economic juncture\", the International Monetary Fund (IMF) said while approving a $1.17 billion bailout plan amid widespread destruction due to floods. IMF's Executive Board completed the reviews of a loan facility for Pakistan on Monday. It will put the cash-starved country's economy back on track averting an imminent default amid persisting political uncertainty.\n","18":"The National Payments Corporation of India (NPCI) has received clearance from Reserve Bank of India (RBI) and Union Ministry of Finance to acquire a 10% stake in Open Network for Digital Commerce (ONDC). Reportedly, Bank of India is also looking to acquire 5-7% stake in the company. ONDC currently has 17 stakeholders, and is aiming to have 20. ","19":"According to a report by Redseer Strategy Consultants, the general business-to-business (B2B) trade in India will reach $1.2 trillion by 2030, with the driving factor being B2B e-commerce. The unorganised general trade channel that drives India's retail market will double from $0.7 trillion to $1.4 trillion. The B2B e-commerce market will reach $90-100 billion in gross merchandise value. ","20":"Tata Steel has said that it will invest more than €65 million for hydrogen-based steel manufacturing in the Netherlands. The company has signed pacts with three firms - McDermott, Danieli and Hatch for further technical preparations. McDermott will manage construction input, Danieli will oversee engineering design and Hatch will help improve the final steel quality.","21":"Tata-owned Air India announced on Tuesday that Captain RS Sandhu will continue to lead as its Chief of Operations till further notice. In July 2020, the Appointments Committee of the Cabinet cleared his appointment for the role. This makes Sandhu one of the few top management people from Air India's government-owned days to be retained after the Tatas took over.","22":"Reliance Industries has acquired soft drink brand Campa from Pure Drinks Group to add to its FMCG portfolio, as per reports. The deal is estimated to be ₹22 crore and Reliance is looking to re-launch Campa nationally by Diwali in three flavours. This will include its original Campa Cola, lemon and orange variants.","23":"IDBI Bank and the NSE-backed National Securities Depository Limited (NSDL) is likely to shortlist seven investment banks as advisors in its preparation to launch an initial public offer next year, according to reports. If the listing is successful, NSDL will become the second depository services firm to be listed on Indian bourses after Central Depository Services Limited's debut in 2017.\n","24":"In August 2022, the first month of net inflows for Dalal Street since September 2021, foreign portfolio investors (FPIs) emerged as net buyers of Indian equities with net purchases at ₹22,025.8 crore for the month, provisional exchange data showed. Net sales by domestic institutional investors (DIIs) stood at ₹7,068.9 crore. This was first month of DIIs' outflows in 16 months.","25":"Snap said on Wednesday it will lay off 20% of its staff and shut down original shows, in-app games and several other projects as part of a corporate restructuring. As per CEO  Evan Spiegel, Snap's current revenue growth rate is \"well below\" what the company was expecting. The cut will help Snap save an estimated $500 million in costs annually. ","26":"Tesla CEO Elon Musk's legal team has filed another notice informing about the termination of his $44 billion deal to buy Twitter, citing additional reasons. The follow-up notice cited allegations made by whistleblower Peiter Zatko as additional reasons to terminate the deal and stated that those allegations were known to Twitter prior to July 8 but weren't disclosed to them. ","27":"Jose Alvarez Toledo, a Tesla Model 3 owner from US' San Francisco, has sued Tesla in a proposed class action over the car suddenly stopping for non-existent obstacles. He called it a \"frightening and dangerous nightmare\". The lawsuit seeks class action status for all US owners or lessors of a Tesla that suffers from the sudden unintended braking defect.","28":"Two senior advertising executives at Snap quit hours after a report emerged stating that the company was planning to cut about 20% of its workforce. Earlier, a report by The Verge, while citing sources, said that Snap is planning to lay off 20% of its more than 6,400 employees after it reported weak Q2 results. ","29":"Facebook’s Gaming app for iOS and Android is shutting down and will no longer be available for download from October 28, 2022. The Meta-owned company didn't specify the reason for shutting down the app. While Facebook Gaming was introduced in 2018, it took the service two years to develop a mobile app. \n","30":"Tesla CEO Elon Musk is seeking to delay the trial with Twitter until November, as per court filings. The five-day trial is currently scheduled to start on October 17. The court filings came after Musk's legal team sent a fresh letter to Twitter to include whistleblower Peiter Zatko's claims as another reason to end the $44 billion deal.","31":"Netflix on Tuesday announced that it has hired two top executives from Snap Inc. The firm's Chief Business Officer Jeremi Gorman has been hired as Netflix's head of worldwide advertising while Snap Inc's VP of advertising sales Peter Naylor has been hired for the same role. The hiring signals Netflix's commitment to building an ad-supported version of its streaming service.","32":"Google has launched a new Vulnerability Reward Program under which it'll award up to $31,337 (nearly ₹25 lakh) to researchers who spot vulnerabilities in Alphabet and Google's Open Source projects. The rewards will range from $100 to $31,337. The larger amounts will go to unusual or particularly interesting vulnerabilities, \"so creativity is encouraged\", Google said while launching the programme.","33":"Tesla has revealed that it has been building a virtual power plant (VPP) on Japan's Miyakojima island since 2021 and now has over 300 Powerwall batteries installed. It's the largest commercial VPP in Japan, the company said in a statement. Installed at homes, these solar-powered batteries can send excess power to the area's electric grid when power supply is strained.","34":"An Australian regulator sent legal letters to Meta, Apple and Microsoft, asking them for strategies to stamp out child abuse material from their platforms. Firms face a $383,000 fine per day each if they fail to comply. Out of 29.1 million reports of child abuse materials received from internet firms this year, 22 million were from Facebook, a report said.","35":"Indonesia's largest technology firm GoTo is seeking to raise about $1 billion through a convertible bond issue, Reuters reported. The company, formed last year after the merger of ride hailing firm Gojek and e-commerce leader Tokopedia, is reportedly working with three financial advisors for the offering. The offer is expected to be launched in the fourth quarter.","36":"LinkedIn is being used by hackers to spread data-stealing malware by sending connection requests in disguise of people working with reputed firms, a CloudSEK report said. Hackers share malicious files and links which deploy a stealer malware for stealing passwords and other sensitive data. \"This large-scale misuse of LinkedIn could be the gravest threat yet,\" CloundSEK CEO Rahul Sasi said.","37":"The total number of electric vehicles (EV) on Indian roads is likely to reach 45 to 50 million by 2030, according to a report by consultancy firm KPMG. As per the Ministry of Road Transport and Highways, there are currently 13,92,265 EVs plying on Indian roads and EV sales in India have seen a three-time growth over the past year.","38":"Japan's Ministry of Economy, Trade and Industry said that the country needs an investment worth over $24 billion from the public and private sectors to develop a competitive manufacturing base for batteries used in electric vehicles (EVs). A specialist panel has set a target of securing 30,000 trained workers for battery manufacturing and supply chains by 2030.\n","39":"Mobile gaming and sports media platform Nazara Technologies Limited on Tuesday announced that it will acquire a 100% stake WildWorks, a US-based children’s interactive entertainment company for $10.4 million in an all-cash transaction. Nazara's shares surged nearly 2.6% to touch an intraday high of ₹647.35 and were trading 1.8% higher on the BSE at 11.25 am.","40":"Google has launched a new Vulnerability Rewards Program (VRP) to reward researchers for finding bugs in its open source projects. The rewards will range from $100 to $31,337, with larger amounts to be given for finding bugs in most sensitive projects like Angular and Golang. Google said it has given over $38 million through its existing VRP programs so far.","41":"Infosys said that it has divested its stake in Trifacta Inc, a data preparation software company, for $12 million. Infosys had invested $4 million in the San Francisco-based company in 2016. It had a minority holding not exceeding 20% of Trifacta's outstanding share capital. Trifacta was founded in 2012 and its investors include Accel, Greylock Partners, Ignition and Cathay Innovation.\n","42":"Microsoft's cloud computing changes faced criticisms from Amazon and Google on Tuesday with both saying that the changes discourage customers from switching to rival cloud service providers thereby limiting competition. After cloud service providers complained to the EU antitrust regulators against Microsoft, it announced amended licensing deals and changes that will be brought in on October 1.\n","43":"JP Morgan's digital assets division head Umar Farooq said majority of crypto assets are \"junk\" and actual crypto use cases haven't fully materialised. Regulation hasn't kept up with the expanding industry, thereby discouraging many conventional financial institutions from participating, he said. Industry hasn't developed sufficiently to be used to support high-value serious transactions, he added.","44":"SoftBank Group's Corporate Officer and Executive Vice President Rajeev Misra is stepping down from his roles, the Japanese conglomerate said on Wednesday. This development follows a record loss at the Japanese investment group after a slide in technology stocks. Misra will retain his position as head of SoftBank Investment Advisers, which oversees the first Vision Fund's existing investments.\n","45":"Snapchat has released a 'Dual Camera' feature which will allow users to capture photos and videos using their phone's front-facing and rear cameras simultaneously. The feature will be available for iOS users on iPhone XS\/XR or above, with Android compatibility rolling out later. Users will get to align their two images horizontally or vertically or use a picture-in-picture mode.    ","46":"Over 45 data centres spanning nearly 13 million square feet and with 1,015 MW of IT capacity are planned to come up in India by 2025-end, according to an ANAROCK-Binswanger report. In terms of IT capacity, over 69% of planned supply will come up in Mumbai and Chennai. COVID-19 outbreak has propelled data centre business forward, an ANAROCK official said.","47":"Ex-US President Donald Trump's Truth Social app hasn't yet been approved for distribution on Google Play Store due to insufficient content moderation, according to reports. Google's concerns reportedly relate to content such as physical threats and incitements to violence. \"On August 19, we notified Truth Social of several standard policy violations in their current app submission,\" Google said.","48":"Indian Computer Emergency Response Team (CERT-In) has advised users to immediately update Mozilla Firefox browsers to avoid various vulnerabilities. The bugs in the browser could allow a remote attacker to bypass security restrictions, execute arbitrary code and cause denial of service attack on the targeted system, CERT-In said. Vulnerabilities exist due to abuse of XSLT error handling, it added.","49":"Cybercrime cases reported in India in 2021 rose by 5% compared with 2020 and fraud was the most common cybercrime motive, according to National Crime Records Bureau's latest data. While charge sheets were filed in only one-third of such cases, the states of Assam, Karnataka, Telangana and UP reported over 70% of cybercrimes. India reported 52,974 cybercrime cases in 2021.","50":"Actor Shah Rukh Khan took to social media to share a picture of Lord Ganesha's idol on the occasion of Ganesh Chaturthi. \"Ganpatiji welcomed home by lil one and me...the modaks after were delicious...the learning is, through hard work, perseverance & faith in God, you can live your dreams. Happy Ganesh Chaturthi to all,\" he wrote. ","51":"The ED's chargesheet filed against Jacqueline Fernandez said the actress not only \"consciously chose to overlook conman Sukesh Chandrasekhar's criminal past\" but also \"continued to indulge in financial transactions with him\". She \"cooked up a false story\" to crawl out of investigations, the chargesheet said. She also knew that Leena Maria Paul is his wife in February 2021, ED added.","52":"Delhi's Patiala House Court has summoned actress Jacqueline Fernandez, directing her to appear in court on September 26, in connection with a ₹200 crore extortion case involving conman Sukesh Chandrasekhar. A lawyer appearing for Delhi Police's Economic Offences Wing informed the court that Fernandez has been also summoned by Delhi Police on September 12 to join the probe.","53":"Aamir Khan's 'Laal Singh Chaddha' has not been able to collect ₹60 crore at the domestic box office and the actor has decided to absorb the losses by forgoing his fee, reports said. The producers Viacom18 lost ₹100 crore on the film but if Aamir decides to let go of his fee, the losses will be comparatively lesser, reports added.","54":"South Korea is considering a survey to determine whether members of K-pop band BTS should be granted exemptions from mandatory military service, officials said. The Defence Ministry is examining the adequacy of such a study. The military service issue has been debated in the media recently as BTS's oldest member, Jin, faces enlistment at year-end, when he turns 30.","55":"Boxing legend Mike Tyson was reportedly paid around ₹25 crore to star in Vijay Deverakonda's 'Liger'. As per reports, Karan Johar, who co-produced the Hindi version of the film, was not willing to cast Mike in 'Liger'. However, director Puri Jagannadh was reportedly fixated on casting the former boxer, irrespective of the cost. 'Liger' released on August 25.","56":"'The Sandman' author Neil Gaiman revealed that Michael Jackson wanted to play Morpheus in the television version of the comic book series. Remembering his visit to Warner Bros in 1996, Neil said that the then-president of the production house told him that Michael had called them to ask if he could be a part of the television adaptation. ","57":"Kiara Advani said she \"learned how to face the camera\" from her 'Good Newwz' co-star Kareena Kapoor Khan. She said during the film's shoot, she used to be so involved in a scene that she would forget about camera angles. However, that never happened with Kareena. Kiara said Kareena \"would know where the camera is, even if it's behind her\".","58":"Actor Jesse Tyler Ferguson has revealed that he was not the first choice to be the wedding officiant for his 'Modern Family' co-star Sarah Hyland. \"I don't know if people know this, but Ty Burrell was meant to do it and there was a family emergency,\" he stated. Ty played Sarah's father in the show 'Modern Family'.","59":"Discussing the failure of Vijay Deverakonda-starrer 'Liger', Warangal Srinu, who was the film's distributor in the South, said, \"I've lost...65% of my investment.\" \"Sabotage is the word,\" he added. \"Do we realise that in our quest to ban actors...we're ruining poor families...The movie industry is going through a very bad phase...There's...a concerted campaign...almost everyday,\" stated Srinu.","60":"'The Immortal Ashwatthama' producer Ronnie Screwvala is reportedly waiting to see how Ranbir Kapoor's 'Brahmastra' performs at the box-office. If 'Brahmastra' earns ₹150-200 crore, it will give 'The Immortal Ashwatthama' team the confidence to spend ₹300 crore on its making, a source told Mid-day. Just like 'Brahmastra', Vicky Kaushal's film is also based on Indian mythology and superpowers. ","61":"Tamil actor Chiyaan Vikram has shared that he would like to work with his contemporary Vijay under the direction of filmmaker Ajay Gnanamuthu. Vikram spoke about Vijay during a Twitter conversation, which was conducted on Tuesday to promote his film 'Cobra'. In response, director Ajay Gnanamuthu said he would be the first person to buy a ticket for the film. ","62":"Nikhil Siddhartha shared that his film 'Karthikeya 2' has \"crossed the ₹100 crore gross mark officially\" at the box office. The actor thanked the audience for their \"love and affection\" for the film. \"Will always try and work hard to live up to it,\" he wrote. The film is being screened on over 3,000 screens across India.","63":"Actress Shefali Shah, speaking about the recently released new season of her OTT series 'Delhi Crime', has said, \"The kind of response I have been receiving...is enormous.\" She further added that her character in the series is \"very dear and personal\" to her. \"I'm overwhelmed and grateful to know it has touched everyone as deeply,\" she stated.","64":"Actress-politician Ramya on Wednesday announced her return to films and that she will also be producing cinema under her production house, AppleBox Studios. The Kannada actress shared that she is \"producing two theatrical films\", which will be distributed by KRG Studios. \"I am very excited about these projects,\" she said, adding that AppleBox Studios will also be producing OTT content.","65":"The executive director of G7 Multiplex and Maratha Mandir Cinema, Manoj Desai, opened up after one theatre has been shut down temporarily after recent films failed to attract people. \"There's no film. Even next week, there's no film. I'll have to see...whether I should keep both Gaiety...Galaxy shut till September 9,\" he stated. 'Brahmastra' will release on September 9.","66":"Punjabi actor-singer Gippy Grewal said Dharmendra got \"emotional\" and had \"tears\" after Gippy shared that he was turned away from the actor's home while visiting for the first time. \"He said, 'Why did you tell...? I won't be able to sleep',\" added Gippy. Gippy further stated that he annoyed actor Govinda \"a lot\" while visiting Mumbai for the first time.","67":"Actress Mouni Roy has confirmed that Shah Rukh Khan will be seen in a guest appearance in 'Brahmastra'. The actress said that even she was supposed to have a special appearance in 'Brahmastra', but her role \"became lengthier\" and soon, she was the main villain in the film. She said it's \"one of the most challenging roles\" of her career. ","68":"Allu Arjun's 'Pushpa: The Rise' was recently screened at the Moscow International Film Festival under the 'Blockbuster hits around the world' category. The Embassy of India in Moscow shared the news on its Instagram account. It said the film created a \"sensation all over the world and stood as the highest grosser in India for the year 2021\". ","69":"'The Kashmir Files' actress Pallavi Joshi has responded to the opposition to her film's Oscar bid. \"An award is about cinematic merit...Judge the film accordingly. But do so only on its cinematic merit,\" she stated. This comes after Anurag Kashyap and Dylan Mohan Gray had openly opposed the film being in contention to be sent to the Oscars.","70":"Actress Shraddha Kapoor, speaking on the occasion of Ganesh Chaturthi, has said that the whole energy that comes with the festival is \"amazing\". \"We've been inviting Bappa for almost 60 years now...The one thing I love the most about this festival is that I get to catch up with all my relatives during this time,\" she added.","71":"Kartik Aaryan, who visited Lalbaugcha Raja on Ganesh Chaturthi, shared pictures of himself on social media platforms and thanked Lord Ganesh for making 2022 \"a life-changing year\". \"Blessed to get my first darshan,\" he wrote. Kartik, whose 'Bhool Bhulaiyaa 2' performed well at the box office, also hoped that Lord Ganesh continues to bless him and fulfil his wishes. ","72":"Actress Kriti Sanon said her mother asked her to reject a role in filmmaker Karan Johar's short film in 'Lust Stories', which Kiara Advani played eventually, as the script's \"focus was only on sensual scenes\". \"My family is middle-class and for them [such] controversial themes...can be...shocking,\" added Kriti. Kiara earlier said she accepted the role \"only\" to work with Johar.","73":"Kunal Kemmu on Wednesday announced his directorial debut, titled 'Madgaon Express', which is also written by him. He said the journey of becoming a director started with a thought, which turned into a dream and then turned into words on his laptop, and now, it's becoming a reality. He thanked Ritesh Sidhwani and Farhan Akhtar for believing in his vision.","74":"Tiger Shroff reportedly signed 'Ganapath', 'Bade Miyan Chote Miyan' and 'Screw Dheela' for ₹35 crore, ₹45 crore and ₹35 crore, respectively. As per reports, after 'Heropanti 2' failed at the box office, the producers have asked Tiger to reduce his remuneration by 50%. Reportedly, Akshay Kumar has also cut down his fee for 'Bade Miyan Chote Miyan'. ","75":"India beat Hong Kong by 40 runs to qualify for Super 4 stage of Asia Cup 2022. Suryakumar Yadav slammed 68*(26), the highest score by a batter in the ongoing tournament. He also recorded most sixes by an Indian (six) in a T20 Asia Cup match and most runs by an Indian (26) in 20th over of a T20I match.","76":"Suryakumar Yadav on Wednesday broke the record for smashing the most number of sixes by a Team India batter in a men's T20 Asia Cup match. Suryakumar slammed six sixes against Hong Kong on Wednesday. No other Indian batter has slammed more than three sixes in a men's T20 Asia Cup match. Suryakumar scored 68*(26) against Hong Kong.","77":"Following his match-winning performance against Pakistan, Team India all-rounder Hardik Pandya jumped eight places in the latest rankings for T20I all-rounders to a career-best fifth position. Pandya took three wickets and scored an unbeaten 33 off 17 deliveries against Pakistan. Pandya is ranked 76th and 79th in T20I rankings for batters and bowlers, respectively.","78":"Hong Kong captain Nizakat Khan won the toss and elected to bowl first against India in their Asia Cup 2022 match on Wednesday. India have made one change to their playing XI, with Rishabh Pant replacing Hardik Pandya. India captain Rohit Sharma said at the toss that they are resting Hardik, who was named Player of the Match against Pakistan.","79":"Indian fan, who was seen wearing a Pakistan jersey during the Indian-Pakistan Asia Cup 2022 match in Dubai on Sunday, has received death threats, with people terming him a \"traitor\". The man, who hails from Uttar Pradesh, stated that he wore Pakistan jersey to tease Pakistani fans. He added that when he reached the stadium, Indian jerseys were sold out.","80":"Team India captain Rohit Sharma has become the first cricketer to score 3,500 runs in T20I cricket. The 35-year-old reached the milestone during his 13-ball 21-run innings against Hong Kong in Asia Cup 2022. It was Rohit's 126th innings in T20Is. Rohit also holds the record for most hundreds in T20I cricket with four tons.","81":"India and Pakistan players have been fined 40% of their match fee each for maintaining a slow over-rate in their Asia Cup 2022 match on Sunday. Match referee Jeff Crowe imposed the sanctions after Rohit Sharma and Babar Azam's sides were ruled to be two overs short of their respective targets after time allowances were taken into consideration.","82":"During a press conference ahead of India-Hong Kong Asia Cup 2022 match, a journalist asked Ravindra Jadeja why Rishabh Pant wasn't included in India's playing XI for the match against Pakistan. Jadeja responded, \"I have no idea about this. This question is out of my book.\" India will face Hong Kong tonight.","83":"Czechia's 16-year-old tennis player Sara Bejlek responded to criticism over her father and coach patting her backside after her win in US Open. \"It may...seem inconvenient & uncomfortable to some...but we've already discussed it...It won't happen again,\" Sara said. She added, \"If something similar happened in...Czechia...no one would deal with it...But since we're in US...everyone comments on it.\"","84":"Former Team India captain Virat Kohli on Wednesday bowled an over against Hong Kong in their Asia Cup 2022 match. It is the first time since 2016 that Kohli bowled in a T20I match. He gave away six runs in his over. Kohli has bowled 25.2 overs in T20I cricket, taking four wickets for 204 runs.","85":"A CCTV footage has surfaced online showing a man stealing a one-day-old infant from a hospital in Uttar Pradesh's Meerut. A complaint has been filed by the parents of the infant, in which they mentioned that the man posed as a hospital staff member for stealing the baby. The police has formed a team to nab the accused.","86":"A video went  viral showing Virat Kohli bowing down to Suryakumar Yadav after his knock of 68*(26) against Hong Kong in Asia Cup on Wednesday. Kohli was also seen asking the crowd to cheer for Suryakumar while walking back to the dressing room. Kohli and Suryakumar shared an unbeaten partnership of 98 runs as India registered a total of 192\/2.","87":"Talking about his performance in their Asia Cup match against Bangladesh, Afghanistan spinner Mujeeb Ur Rahman said his plan was to bowl wicket to wicket and it worked. Mujeeb was named 'Man of the Match' after he dismissed Bangladesh's top-three batters while conceding 16 runs in his four overs. Afghanistan chased down Bangladesh's 128-run target in 18.3 overs. ","88":"Ex-cricketer Wasim Jaffer has said India are unlikely to make any changes in their playing XI for their Asia Cup match against Hong Kong. \"I don't think one or two failures will make them drop KL Rahul or make any changes unless there's an injury issue,\" he stated. Rahul was dismissed for a golden duck against Pakistan. ","89":"Ex-India cricketer Parthiv Patel has said that he was surprised by Rishabh Pant's exclusion from India's playing XI against Pakistan in the Asia Cup. \"Everyone is debating over who should play, Rishabh Pant or Dinesh Karthik. But that's a wrong comparison...I feel Kohli should open in place of KL Rahul and Pant should bat in the middle order,\" added Parthiv.","90":"Commentator Aakash Chopra has said if Team India needs a left-hander at the number four position, then Rishabh Pant should be included in the playing XI. \"Because, at number seven, you are doing a grave injustice to Dinesh Karthik also,\" stated Aakash. India had promoted left-handed all-rounder Ravindra Jadeja to the number four position against Pakistan. ","91":"Ex-Team India wicketkeeper-batter Parthiv Patel said there is \"no point\" in Team India all-rounder Hardik Pandya playing against Hong Kong if he is not going to bowl. \"I don't see Hardik bowling against Hong Kong...If he isn't playing, then Deepak Hooda could come in,\" added Parthiv. Hardik picked three wickets while conceding 25 runs in India's win against Pakistan.","92":"Australia opener David Warner has extended greetings on the occasion of Ganesh Chaturthi. Warner took to Twitter to share a photo of him praying to Lord Ganesha and wrote, \"To all of my friends out there, Happy Ganesh Chaturthi. Wishing you lots of joy and happiness!\" Warner is currently part of Australia's three-match ODI series against Zimbabwe. ","93":"Ex-India cricketer Ajay Jadeja said he \"won't be surprised\" if Afghanistan \"knock one of the big teams off\", having defeated Sri Lanka and Bangladesh in the Asia Cup so far. \"Imagine either of the teams, India or Pakistan, are 20\/2 or 30\/2, then Afghanistan won't allow them to make a comeback. These guys have that ability,\" added Ajay.","94":"Discussing Virat Kohli's 35 off 34 balls against Pakistan, Virender Sehwag said, \"He'd never get out in a chase of 150. Never...[played] such poor shots.\" \"The batting which we're used to seeing from Kohli...that's yet to be seen,\" added Sehwag. \"We're hoping that by the time [the] T20 World Cup comes around, Kohli returns to the old mindset,\" he stated.","95":"Ex-Team India opener Wasim Jaffer said Team India faced a \"lot of\" difficulty when they last played against Hong Kong in the Asia Cup in 2018. \"They had a 174-175 run opening partnership...It was a very close match...India won't be complacent at all,\" added Jaffer. Hong Kong captain Nizakat Khan earlier stated \"anything can happen\" when the teams face off.","96":"Former India cricketer Saba Karim has said with Dinesh Karthik being preferred for the role of a finisher in T20Is, wicketkeeper-batter Rishabh Pant can only get into the playing XI if KL Rahul doesn't find his form. \"Only then, Pant could get a chance to play [as an opener]. Otherwise, there is no place vacant,\" added Karim.","97":"During a discussion ahead of India's match against Hong Kong, Sanjay Manjrekar said the competition from youngsters will not make things easy for Virat Kohli in upcoming matches. To this, Scott Styris said, \"I can't believe that.\" The ex-NZ cricketer further said, \"Are we really talking about Kohli not making this team?\" Kohli scored 35(34) against Pakistan on Sunday. ","98":"Former Afghanistan captain Asghar Afghan said Afghanistan can beat Pakistan in the Asia Cup if they remain calm. \"The Indian players can play our bowlers well because they have played a lot [against them] in the IPL...They have an idea of our bowlers,\" added Asghar. \"The players of Pakistan...don't know how to tackle our bowlers,\" he stated.","99":"Sri Lanka spinner Maheesh Theekshana, during an interview, predicted that Virat Kohli will score his 71st international century against Hong Kong today. Theekshana further said that he wants India and Sri Lanka to feature in the final of the ongoing Asia Cup. \"I want to...get Kohli out. He is an absolutely brilliant player,\" added the 22-year-old. "}}